{
  "the_fool": {
    "name": "The Fool",
    "number": 0,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/00-the-fool.png",
    "keywords": [
      "Beginnings",
      "Innocence",
      "Curiosity",
      "Spontaneity",
      "Potential"
    ],
    "description": "A new journey begins with instinct, not information. Drawn by wonder that overcomes fear. Trust rises before certainty and opens the gate to both freedom and folly.",
    "visual_description": "The Fool stands on the precipice of a cliff, caught in the first breath of a journey. Their garments are loose and flowing, evoking freedom and non-attachment. The figure gazes skyward, head tilted in wonder, as if entranced by possibility rather than focused on the path ahead. They hold a small satchel—light baggage, both literal and metaphorical—suggesting the bare essentials of experience or memory are carried into this new beginning. Nestled between their feet is a small white kitten, calm and wide-eyed, peering upward. Unlike the traditional white dog that barks warnings, this kitten offers quiet companionship and a subtler symbol: curiosity, vulnerability, and intuition without alarm. It represents innocence, receptivity, and the soft guidance of inner knowing. That it sits between the Fool’s legs, rather than trailing or leaping, emphasizes stillness and presence within the unknown. Behind them, a burst of radiance or stylized sun spills upward—a symbol of illumination, divine spark, or the unshaped potential of what lies ahead. The cliffside is clear, earthy, and undramatic; the danger is real, but not emphasized. This is not a card of peril, but of invitation.",
    "general_meaning": "The Fool represents beginnings—the sacred first step into the unknown. It is a card of potential, curiosity, and intuitive risk. There is no map yet, only a call. The Fool moves without fear not because danger is absent, but because wonder outweighs hesitation. This card invites openness, trust, and an embrace of possibility. The Fool may also ask: Are you ready to be seen as naïve in order to grow? Are you willing to take the first step, even if you don’t know where it leads?",
    "love": "In love readings, The Fool often signals new beginnings—a budding relationship, a chance to approach love with fresh eyes, or the shedding of old patterns to make room for surprise. It suggests lightness and presence, a willingness to be vulnerable or emotionally spontaneous. In existing relationships, it may ask one or both partners to reconnect with playfulness, honesty, and trust. Sometimes it speaks to taking a leap of faith together, even if you can’t see the outcome clearly. Be mindful: the Fool doesn’t promise permanence—it asks you to say yes to the experience.",
    "spiritual": "The Fool is the archetypal pilgrim—not a teacher or master, but the one who walks. Spiritually, this card represents an openness to divine flow, a readiness to listen rather than lead, and an invitation to begin again. It’s a reminder that spiritual evolution starts with surrender—not knowing. The white kitten reflects a childlike intuition, an inner voice that’s quiet but potent. Trust what you sense, not what others demand to be true.",
    "career": "The Fool in career readings can indicate a new opportunity, project, or path—especially one that defies logic but feels aligned. It may involve a move, a creative risk, or stepping into a role that requires growth and humility. Expect the unexpected; this card often heralds non-linear success. Financially, the Fool encourages experimentation and freedom—but with a warning not to leap without some preparation. Pack light, not blind.",
    "reversed": "Reversed, The Fool suggests hesitation, recklessness, or naivety. The leap becomes a stumble. You may be ignoring real risks or resisting change out of fear. Sometimes, it’s not time to move—more reflection is needed. Other times, it’s a call to take the leap but with greater awareness. The kitten, in reversal, may point to ignored intuition or misplaced trust. Ask yourself: Are you running toward growth or away from responsibility? Are you confusing spontaneity with avoidance?"
  },
  "the_magician": {
    "name": "The Magician",
    "number": 1,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/01-the-magician.png",
    "keywords": [
      "Manifestation",
      "Creation",
      "Skill",
      "Confidence",
      "Intent"
    ],
    "description": "With one hand to the sky and one to the earth, he channels energy from spirit into matter. The tools are ready, but only will activates them.",
    "visual_description": "The Magician stands poised between worlds. One arm reaches upward, fingers extended to the unseen, while the other points down toward the earth—forming a conduit between the divine and the material. This classic posture, often referred to as “as above, so below,” emphasizes his role as the bridge between inspiration and reality. Laid before him are four tools—each representing the suits of the tarot: a cup, a sword, a wand, and a pentacle. These are not simply props; they are elements of creation, gifts already at hand. The message is clear: everything needed is already here, waiting for alignment and intention. Above his head, the symbol of infinity floats—an emblem of limitless potential and the boundless nature of focused will. The background often shows blooming flowers or a luminous space, signifying vitality, manifestation, and a charged atmosphere ready to respond. Where the Fool was pure potential, the Magician begins to shape that potential into form. He is both stage performer and spiritual channel—one who blends mystery with execution.",
    "general_meaning": "The Magician is a card of manifestation, action, and alignment. It signals a moment when intention, skill, and timing converge. You have what you need—the tools, the drive, the clarity. The question is: will you use them? This card calls for deliberate creation, not passive wishing. It speaks to your ability to shape reality through focus, confidence, and conscious choice. When the Magician appears, the window is open. Speak clearly. Move decisively. Don’t wait for more signs—this is it.",
    "love": "In love, the Magician signals charisma, attraction, and intentional connection. If you’re single, it can suggest someone with charm and focus entering your life—or your own readiness to manifest the kind of relationship you want, rather than waiting for it. In established relationships, this card asks: Are you actively co-creating, or letting things drift? The Magician brings the reminder that desire and energy need direction. Speak your needs. Set the tone. It can also point to illusion or manipulation—especially if other cards show imbalance. Is what’s being offered real? Or just skillfully performed?",
    "spiritual": "Spiritually, the Magician is the first conscious awakening of power—the realization that you are not a passive participant in your life, but a co-creator. This card invites you to clarify your will, align your thoughts and actions, and recognize your capacity to influence reality. Ritual, affirmation, creative practices, and direct energetic work are especially powerful under this card. You are in the “doing” phase of spiritual growth—not retreat, not surrender, but active engagement with the unseen. It’s also a reminder: power without intention is just noise.",
    "career": "In career readings, the Magician signals a green light for action. You have the talent, the tools, and the timing. It may be time to pitch an idea, apply for something bold, or step into a more visible or leadership role. This card can also indicate a moment of persuasive clarity: presentations, interviews, negotiations, and strategy are favored when the Magician appears. Financially, it may be a good time to initiate projects that require will and effort—investments, new ventures, entrepreneurial work. But it comes with a caveat: results depend on how skillfully you wield what’s in front of you.",
    "reversed": "Reversed, the Magician warns of manipulation, misalignment, or lost potential. The tools are there, but they’re scattered. The energy is present, but it’s chaotic or self-serving. You may be faking confidence—or allowing imposter syndrome to block your ability. This reversal often shows up when you’re saying the right things but not doing the work, or when you’re trying to control outcomes rather than channel them. It may also reflect someone else using charm or skill deceptively. Ask: Is the power being used ethically? Is this grounded in truth? Reclaim your focus. Recenter your will. The tools haven’t gone anywhere—they’re just waiting for you to pick them up with clear hands."
  }
}