{
  "the_fool": {
    "name": "The Fool",
    "number": 0,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/00-the-fool.png",
    "keywords": {
      "upright": ["Beginnings", "Innocence", "Curiosity", "Spontaneity", "Potential"],
      "reversed": ["Recklessness", "Hesitation", "Naivety", "Fear", "Foolishness"]
    },
    "description": "A new journey begins with instinct, not information. Drawn by wonder that overcomes fear. Trust rises before certainty and opens the gate to both freedom and folly.",
    "visual_description": "The Fool is Brad, standing at the edge of a cliff, caught in the first breath of a journey. His loose, flowing garments evoke freedom and non-attachment. Gazing skyward, head tilted in wonder, he seems entranced by possibility rather than grounded in the path. A small satchel—light baggage, literal and metaphorical—suggests only the bare essentials of memory are carried forward. Between his feet sits a calm white kitten, wide-eyed and upward-looking. Unlike the traditional barking dog, the kitten symbolizes curiosity, vulnerability, and quiet intuition. Its stillness beneath the Fool emphasizes presence within uncertainty. Behind them, a stylized sun rises over the Wind River Range—a symbol of divine spark and unshaped potential. The cliffside is clear and earthy, offering real danger without dramatics. This is not a card of peril, but of invitation.",
    "general_meaning": "The Fool represents beginnings—the sacred first step into the unknown. It is a card of potential, curiosity, and intuitive risk. There is no map yet, only a call. The Fool moves without fear not because danger is absent, but because wonder outweighs hesitation. This card invites openness, trust, and an embrace of possibility. The Fool may also ask: Are you ready to be seen as naïve in order to grow? Are you willing to take the first step, even if you don’t know where it leads?",
    "love": "In love readings, The Fool often signals new beginnings—a budding relationship, a chance to approach love with fresh eyes, or the shedding of old patterns to make room for surprise. It suggests lightness and presence, a willingness to be vulnerable or emotionally spontaneous. In existing relationships, it may ask one or both partners to reconnect with playfulness, honesty, and trust. Sometimes it speaks to taking a leap of faith together, even if you can’t see the outcome clearly. Be mindful: the Fool doesn’t promise permanence—it asks you to say yes to the experience.",
    "spiritual": "The Fool is the archetypal pilgrim—not a teacher or master, but the one who walks. Spiritually, this card represents an openness to divine flow, a readiness to listen rather than lead, and an invitation to begin again. It’s a reminder that spiritual evolution starts with surrender—not knowing. The white kitten reflects a childlike intuition, an inner voice that’s quiet but potent. Trust what you sense, not what others demand to be true.",
    "career": "The Fool in career readings can indicate a new opportunity, project, or path—especially one that defies logic but feels aligned. It may involve a move, a creative risk, or stepping into a role that requires growth and humility. Expect the unexpected; this card often heralds non-linear success. Financially, the Fool encourages experimentation and freedom—but with a warning not to leap without some preparation. Pack light, not blind.",
    "reversed": "Reversed, The Fool suggests hesitation, recklessness, or naivety. The leap becomes a stumble. You may be ignoring real risks or resisting change out of fear. Sometimes, it’s not time to move—more reflection is needed. Other times, it’s a call to take the leap but with greater awareness. The kitten, in reversal, may point to ignored intuition or misplaced trust. Ask yourself: Are you running toward growth or away from responsibility? Are you confusing spontaneity with avoidance?"
  },
  "the_magician": {
   "name": "The Magician",
   "number": 1,
   "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/01-the-magician.png",
   "keywords": {
    "upright": ["Manifestation", "Creation", "Skill", "Confidence", "Intent"],
    "reversed": ["Manipulation", "Disconnection", "Illusion", "Control", "Insecurity"]
   },
   "description": "With one hand to the sky and one to the earth, he channels energy from spirit into matter. The tools are ready, but only will activates them.",
   "visual_description": "The Magician is portrayed as Ricky, honoring his role in bringing the deck to life and his uncanny ability to turn nonsense into reality. He stands with one hand raised to the sky and the other pointing to the ground—a gesture of 'as above, so below' that marks him as the conduit between vision and form. Laid before him are four symbolic tools: a cup, a sword, a wand, and a pentacle, representing the suits and the powers of creation already at his disposal. Above his head floats the infinity symbol, denoting boundless potential and focused intent. His expression is confident, slightly amused, as if mid-spell or mid-joke—or both. The backdrop features blooming flowers and radiant swirls of energy, suggesting vitality, charged possibility, and a sense that the air itself might shimmer with becoming. Ricky’s presence reframes the archetype with personal flair: part performer, part channel, and all manifestation.",
   "general_meaning": "The Magician is a card of manifestation, action, and alignment. It signals a moment when intention, skill, and timing converge. You have what you need—the tools, the drive, the clarity. The question is: will you use them? This card calls for deliberate creation, not passive wishing. It speaks to your ability to shape reality through focus, confidence, and conscious choice. When the Magician appears, the window is open. Speak clearly. Move decisively. Don’t wait for more signs—this is it.",
   "love": "In love, the Magician signals charisma, attraction, and intentional connection. If you’re single, it can suggest someone with charm and focus entering your life—or your own readiness to manifest the kind of relationship you want, rather than waiting for it. In established relationships, this card asks: Are you actively co-creating, or letting things drift? The Magician brings the reminder that desire and energy need direction. Speak your needs. Set the tone. It can also point to illusion or manipulation—especially if other cards show imbalance. Is what’s being offered real? Or just skillfully performed?",
   "spiritual": "Spiritually, the Magician is the first conscious awakening of power—the realization that you are not a passive participant in your life, but a co-creator. This card invites you to clarify your will, align your thoughts and actions, and recognize your capacity to influence reality. Ritual, affirmation, creative practices, and direct energetic work are especially powerful under this card. You are in the “doing” phase of spiritual growth—not retreat, not surrender, but active engagement with the unseen. It’s also a reminder: power without intention is just noise.",
   "career": "In career readings, the Magician signals a green light for action. You have the talent, the tools, and the timing. It may be time to pitch an idea, apply for something bold, or step into a more visible or leadership role. This card can also indicate a moment of persuasive clarity: presentations, interviews, negotiations, and strategy are favored when the Magician appears. Financially, it may be a good time to initiate projects that require will and effort—investments, new ventures, entrepreneurial work. But it comes with a caveat: results depend on how skillfully you wield what’s in front of you.",
   "reversed": "Reversed, the Magician warns of manipulation, misalignment, or lost potential. The tools are there, but they’re scattered. The energy is present, but it’s chaotic or self-serving. You may be faking confidence—or allowing imposter syndrome to block your ability. This reversal often shows up when you’re saying the right things but not doing the work, or when you’re trying to control outcomes rather than channel them. It may also reflect someone else using charm or skill deceptively. Ask: Is the power being used ethically? Is this grounded in truth? Reclaim your focus. Recenter your will. The tools haven’t gone anywhere—they’re just waiting for you to pick them up with clear hands."
  },
  "the_high_priestess": {
   "name": "The High Priestess",
   "number": 2,
   "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/02-the-high-priestess.png",
   "keywords": {
    "upright": ["Intuition", "Mystery", "Secrets", "Depth", "Reflection"],
    "reversed": ["Obscurity", "Superficiality", "Suppression", "Confusion", "Mistrust"]
   },
   "description": "Silence holds what cannot be explained. Truth emerges through stillness; what is hidden offers guidance to those who listen inward.",
   "visual_description": "The High Priestess is rendered as Pebble, seated in a centered, symmetrical pose. Her expression is serene and unreadable, wide eyes open and alert. She wears a deep blue cloak, lined in gray and patterned with faint stars, pooling softly around her paws.\n\nShe sits between two pillars: black (B for Boaz) and white (J for Jachin), symbolic of mystery and clarity, passivity and activity. These form the threshold between opposites. Behind her hangs a cream-colored veil patterned with red pomegranates, symbolizing fertility, inner wisdom, and the cycles of descent and return.\n\nPebble holds a partially unrolled scroll marked TORA between her front paws, its edge dipping into a dark, gently rippling pool at her feet. The fusion of sacred text and water suggests knowledge accessed through reflection.\n\nHer gaze is level and unwavering. She does not reveal, nor does she conceal—she waits. The card evokes duality, inner knowing, and the boundary between intellect and intuition.",
   "general_meaning": "The High Priestess represents the power of inner knowing. She comes when it’s time to listen rather than act—to trust what you sense, even if it defies logic or explanation. She holds the mysteries not because she is hiding them, but because you are meant to approach slowly, with care.\n\nThis card often signals a period of retreat, intuition, and subtle but profound realizations. You are being asked to hold space—not fill it.",
   "love": "This card often reflects emotional undercurrents—longings unspoken, intuitions unexplored. There may be a sense that something is shifting or unknown. The High Priestess invites you to feel before you define, and to trust subtle signals from yourself and others.\n\nIf you're single, pay attention to the energy around you. If partnered, lean into the power of listening and vulnerability. Truth may not be said aloud—but it is present.",
   "spiritual": "The High Priestess is the gateway to spiritual insight. Her presence affirms your path inward—through dreams, meditation, study, or sacred silence. This is not the moment for flashy ritual or external validation. This is a time to tend your inner temple.\n\nYou may experience intuitive breakthroughs, ancestral memory, or the feeling that you’ve known something all along. Follow that thread.",
   "career": "In practical matters, this card signals that all the facts may not be visible yet. Pause before signing, committing, or reacting. Trust your instincts, even if you can't yet articulate why. A hidden factor may be influencing events.\n\nThis is also a strong card for anyone in research, teaching, healing, or intuitive work. Your inner compass is the sharpest tool you have right now.",
   "reversed": "When reversed, the High Priestess warns of disconnection from intuition or fear of your inner voice. You may be relying too heavily on others' advice or ignoring subtle warnings. There could also be secrets—yours or someone else’s—casting confusion or mistrust into a situation.\n\nThis card reversed doesn’t mean the wisdom is gone—it means you may need to re-center, clear noise, and return to your own source of truth."
 },
 "the_empress": {
  "name": "The Empress",
  "number": 3,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/03-the-empress.png",
  "keywords": {
    "upright": ["Fertility", "Nurturing", "Abundance", "Sensuality", "Growth"],
    "reversed": ["Neglect", "Smothering", "Emptiness", "Creative block", "Disconnection"]
  },
  "description": "Creation is not a task—it is a state. She offers not answers but abundance, not control but invitation. Growth follows care, and care begins with presence.",
  "visual_description": "The Empress is portrayed as Summer, seated on an ornate throne surrounded by lush, stylized foliage. Her expression is serene and direct, her gaze steady beneath round glasses. Her long black hair falls over a golden imperial robe, echoing Chinese royal tradition.\n\nHer gown features blue stars, red roses, and curling floral patterns—symbols of beauty, creativity, and natural abundance. A tall pointed crown rests on her head, encircled by glowing five-pointed stars, suggesting cosmic harmony and divine authority. She wears teardrop earrings with circular motifs—elegant and deliberate.\n\nThe throne is carved with swirling patterns, mirrored by spiraling clouds and radiant beams in the sky behind her. On the left, wheat stalks rise; to the right, a winding river flows past distant trees—symbols of nourishment and receptivity.\n\nThe composition is symmetrical, warm, and full of life. Summer sits not as a remote ideal, but as a sovereign of the natural world—calm, grounded, and effortlessly generative.",
  "general_meaning": "The Empress represents nourishment, fertility, and embodied abundance. She is the archetype of care—not just maternal love, but the deeper force of sustaining presence. Whether in relationships, art, the body, or the land, The Empress calls you to cultivate—not by force, but by trust and attention.\n\nShe is not a provider of answers; she is the one who makes it possible for things to thrive.\n\nThis card asks: What are you tending? What wants to grow through you? Are you offering it enough light, softness, and time?",
  "love": "The Empress suggests warmth, generosity, and sensual connection. In new relationships, she brings a sense of ease and emotional flow. In existing ones, she reminds you that intimacy grows when both partners feel safe, nourished, and seen.\n\nThis card may also represent someone with Empress energy—strong, soft, patient, and magnetic—or a desire for that kind of bond. Her presence often points to emotional ripening, even potential for pregnancy or long-term commitment.\n\nBut most importantly, The Empress asks you to love from fullness, not need.",
  "spiritual": "Spiritually, The Empress invites you into your body, your rituals, and your rhythms. Growth isn’t always vertical—it can be slow, deep, and cyclical. This is a card of grounded devotion: tending altars, walking in nature, honoring the sacred in the ordinary.\n\nRather than seeking escape or ascension, you’re asked to root down, to trust the wisdom of your flesh, and to remember that care itself is holy.",
  "career": "In career readings, The Empress signals creative abundance, steady expansion, and supportive environments. This may be a fertile time for launching a project, nurturing a team, or investing energy into something that brings beauty or connection into the world.\n\nFinancially, this card encourages sustainable prosperity. It supports long-term investments, not risky maneuvers. Work that aligns with your values will feel more fruitful now than work that’s purely strategic.\n\nThe Empress also warns against burnout: your productivity is not your worth.",
  "reversed": "Reversed, The Empress may point to a lack of nurturing—toward yourself, your work, or someone you care for. You may be running dry, giving without replenishing, or withholding care from something that needs it.\n\nIt can also signal over-nurturing: smothering, enabling, or becoming lost in someone else’s needs. Boundaries matter, even for the Empress.\n\nAsk: Am I tending the garden—or trying to control it? What would it mean to give from wholeness, not depletion?"
},
 "the_emperor": {
  "name": "The Emperor",
  "number": 4,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/04-the-emperor.png",
  "keywords": {
    "upright": ["Structure", "Authority", "Discipline", "Leadership", "Stability"],
    "reversed": ["Control", "Rigidity", "Tyranny", "Ego", "Instability"]
  },
  "description": "Power requires presence. The Emperor governs not just with force, but with clarity, consistency, and a grounded sense of responsibility. His authority is earned, not taken.",
  "visual_description": "The Emperor is depicted as Ti, seated on a high stone throne in a firm, symmetrical pose. He is bald with a close beard, his expression composed and commanding. A golden crown of fire hovers above his head, radiating into a starry twilight sky.\n\nHe wears layered red robes with a high collar, wrapped diagonally in a style blending martial and monastic forms. His right hand holds an upright golden ankh; in his left rests a glowing orb of power.\n\nRam heads flank the throne’s back, with stylized rams engraved in the card’s lower corners—symbols of Aries and fire. Behind him rise the sharp granite ridges of Tuolumne. The mountains mark not only strength and clarity, but a personal bet lost—a reminder that Ti still owes Ricky a climbing trip there.\n\nA river winds through the peaks, balancing fire and stone. Red flames adorn the card’s upper corners, and golden spirals drift from the crown.\n\nThis is will shaped into form. Ti rules not by force but by presence—and memory of the mountain still to come.",
  "general_meaning": "The Emperor represents structure, stability, and intentional leadership. He does not chase control but embodies it. His presence signals a time to take responsibility, define boundaries, and lead with clarity and consistency.\n\nHe reminds us that power without grounding becomes tyranny—but structure with purpose becomes legacy. This card invites you to build something lasting by stepping fully into your role.",
  "love": "In love readings, the Emperor suggests commitment, protection, and a steady foundation. He may represent a partner who is loyal, grounded, and dependable—or a call to bring more structure and clarity to your emotional life.\n\nSometimes, this card warns against emotional detachment or dominance in relationships. Love should be strong, but not controlling. Ask: Are you leading together, or pulling in different directions?",
  "spiritual": "Spiritually, the Emperor grounds vision into form. This is a time to build practices, honor discipline, and shape belief into action. He reminds you that spiritual progress isn’t always mystical—it can be structured, daily, and tangible.\n\nWhether through ritual, order, or a commitment to walk your talk, the Emperor helps translate ideals into lived integrity.",
  "career": "In career readings, the Emperor speaks to leadership, management, and taking control of your environment. Whether stepping into authority or creating better systems, this is about building something that lasts.\n\nIf you’re seeking direction, this card says: make a plan. Set expectations. Bring structure to your ambition. It’s not about charisma—it’s about consistency.",
  "reversed": "Reversed, the Emperor warns of imbalance in power dynamics. You may be too rigid, controlling, or resistant to outside input—or you may be avoiding structure entirely, feeling unanchored or unmotivated.\n\nThis card often appears when ego overshadows clarity. Ask: Is the system serving you, or are you serving the system? Are you leading from fear—or from strength?\n\nSometimes, the answer isn’t more control—it’s trust in what you’ve already built."
},
  "the_hierophant": {
  "name": "The Hierophant",
  "number": 5,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/05-the-hierophant.png",
  "keywords": {
    "upright": ["Tradition", "Spiritual Guidance", "Wisdom", "Community", "Ritual"],
    "reversed": ["Dogma", "Rebellion", "Misuse of Power", "Conformity", "Spiritual Confusion"]
  },
  "description": "Some teachings arrive wrapped in mystery. Others come with a third hand and a knowing smirk. The Hierophant doesn’t just deliver the lesson—he reveals how to witness it.",
  "visual_description": "The Hierophant is portrayed as Brad, seated cross-legged on a stone platform beneath a domed arch. He wears layered earth-toned robes and prayer beads across his chest. His expression is calm and lightly amused. A wide halo radiates behind his head.\n\nIn his left hand he holds a golden staff topped with a double cross; his right hand is raised in benediction. A third hand emerges from his robe, holding a scroll—its presence neither hidden nor emphasized.\n\nAt his sides sit two cats. Sid, a tabby on the left, gazes forward calmly, unfazed by the miracle. Pebble, a fluffy Maine Coon on the right, is wide-eyed and open-mouthed, frozen in comic shock.\n\nThey reflect dual responses to tradition: familiarity and awe.\n\nThe stonework around them is carved with vines, lotuses, and sacred geometry. Two pillars support the arch above, and the background glows in green and gold—signs of reverence and generational wisdom.\n\nBrad does not guard knowledge—he offers it. How it’s received is up to you.",
  "general_meaning": "The Hierophant represents lineage, wisdom, and the power of spiritual tradition. It speaks to the value of guidance, mentorship, and learning through trusted systems or teachers. This card often appears when you’re seeking deeper understanding—and the path forward may be illuminated by someone who has walked it before.\n\nIt also challenges you to consider your role in the chain of transmission: Are you the student, the keeper, or the one who disrupts the flow to forge a new way?",
  "love": "In love, the Hierophant suggests a relationship grounded in shared values, cultural or spiritual traditions, or formal commitment. It can signal marriage, family expectations, or mentorship within a partnership.\n\nIf you're seeking love, it may point to someone who shares your belief system—or challenge you to examine how past conditioning shapes your expectations. Are you honoring your truth, or just playing a role?",
  "spiritual": "Spiritually, the Hierophant invites you to study, reflect, and integrate what’s been passed down. This is a card of lineage—not just biological, but energetic. Who taught your teachers? What rituals shaped your worldview?\n\nIt encourages participation in spiritual communities or wisdom traditions, but also challenges blind obedience. Listen, then decide what becomes yours to carry.",
  "career": "In career readings, the Hierophant may indicate mentorship, organizational systems, or roles tied to education, religion, or law. This is a good time to learn from established structures—or challenge and update them.\n\nIt also asks whether your current path aligns with your deeper values. Are you working with purpose? Or following rules without meaning?",
  "reversed": "Reversed, the Hierophant can point to dogma, misuse of authority, or spiritual rigidity. You may be clinging to outdated beliefs or resisting growth because of fear masked as tradition.\n\nAlternatively, it may signal the need to rebel—to break away from systems that no longer reflect your truth. But even rebellion needs reflection. Ask yourself: What are you rejecting—and what are you replacing it with?"
 },
 "the_lovers": {
  "name": "The Lovers",
  "number": 6,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/06-the-lovers.png",
  "keywords": {
    "upright": ["Union", "Choice", "Connection", "Alignment", "Attraction"],
    "reversed": ["Imbalance", "Temptation", "Misalignment", "Indecision", "Conflict"]
  },
  "description": "A shared glance before the leap. Love that invites, dares, and demands choice. The Lovers is less about perfection than presence—meeting the other where they stand, and choosing them again and again.",
  "visual_description": "The Lovers features Emily and Mike Ballanco, barefoot on a winding path beginning at the beach in Lavallette, New Jersey. They wear fig-themed beachwear: Emily in a dark floral dress, Mike in green fig-leaf trunks—evoking Adam and Eve.\n\nMike, on the right, hams it up: arms wide, chest out, eyebrows raised, fully committed to his bit. Emily, on the left, watches with a squinting, amused expression. Her posture is reserved—arms close, amused but wary. She’s seen it countless times before.\n\nBehind them, the landscape splits: on Emily’s side, a flowering vine with a serpent; on Mike’s, flames from a blackened tree—mirroring tradition: knowledge and desire, growth and risk.\n\nAbove, an angel floats in golden radiance, arms open in silent blessing. The clouds swirl but do not storm.\n\nIn the background, a Vail-inspired mountain rises with etched gondola lines—many ways up, but no shortcuts. The lovers stand at the beginning of something chosen, not fallen into.",
  "general_meaning": "The Lovers is about meaningful connection—between people, within the self, and with the world. It often signifies romantic partnership, but at its core, this card is about conscious choice. It asks you to commit, not just to desire or chemistry, but to what love actually requires: presence, vulnerability, alignment, and effort.\n\nIt can also symbolize inner union—bringing together disparate aspects of self, or facing a decision that will shape your path forward.",
  "love": "In love readings, this card signals deep attraction and authentic connection. Whether you’re at the beginning of something or in the midst of something long-standing, it calls for honesty and intention. Are you showing up fully? Are you choosing each other daily?\n\nFor singles, it may herald a meeting of significance. For couples, it may ask: What does it mean to keep choosing? To grow separately and still return to the shared space?",
  "spiritual": "Spiritually, The Lovers represents integration and alignment. It may be time to examine whether your beliefs, values, and actions are in harmony—or if something needs to be reconciled. True spiritual maturity often emerges not from isolation, but from connection.\n\nIt’s also a card of sacred mirroring. Who or what in your life is reflecting your own longing, fear, or growth back to you?",
  "career": "The Lovers in a career context may indicate partnerships, contracts, or a major decision that will define your path. It often appears when your heart and your work need to come into better alignment.\n\nIf you're weighing options, this card suggests choosing not just what’s lucrative, but what’s meaningful. Connection, purpose, and shared vision matter.",
  "reversed": "Reversed, The Lovers points to conflict, indecision, or misalignment. A relationship may be strained, a commitment faltering, or a tempting shortcut undermining long-term integrity.\n\nIt may also signal a failure to choose—drifting instead of engaging. Reconnect with your values. Ask honestly: What are you truly drawn to? And are you willing to show up for it?"
 },
 "the_chariot": {
  "name": "The Chariot",
  "number": 7,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/07-the-chariot.png",
  "keywords": {
    "upright": ["Willpower", "Determination", "Victory", "Control", "Direction"],
    "reversed": ["Lack of direction", "Aggression", "Defeat", "Internal conflict", "Misalignment"]
  },
  "description": "A willful heart moves not through force, but through focus. The Chariot does not yield to pressure—it shapes its own road.",
  "visual_description": "The Chariot features Arden seated in a regal chariot adorned with willow motifs—symbols of adaptability and rooted grace. Her armor echoes her Whiteout Survival avatar: functional, padded, and suited for command. A golden star crowns her helmet, and oversized goggles rest above her brow. Her gaze is steady, composed, and forward-facing.\n\nAt her sides sit two bulldogs: a white English bulldog in a Manchester City scarf, and a black French bulldog with a tricolor sash—symbols of her Manchesterian and Alpine heritage. They sit calmly, offering presence, not pull.\n\nBehind her, the Etihad Stadium rises—softly shaded and silent, like a cathedral of sport. On the right, the French Alps jut upward, hinting at origin and legacy. The River Irwell winds beneath her, connecting geographies.\n\nArden does not race. She steers. The scene reflects quiet will, cultural tension, and sovereign intent—not in motion, but in readiness.",
  "general_meaning": "The Chariot signifies momentum driven by alignment. It is not the chaos of speed but the force of purpose. You are being asked to direct your energy, to know what you want, and to commit to the path ahead. Success comes from inner balance and intentional movement—not brute force.",
  "love": "In relationships, The Chariot can indicate a desire to take the reins—either in pursuit or in healing. If things have felt stagnant, this card brings motion. But direction must be mutual. Are you aligned with your partner—or just dragging them along?",
  "spiritual": "Spiritually, this card speaks to discipline and self-mastery. It’s not a time to drift—this is a call to focus. Choose a path. Choose it clearly. Then commit to walking it, even when the terrain gets uneven. Progress is possible—but only with focus.",
  "career": "The Chariot is a green light. Momentum is gathering, and you are at the helm. Whether it’s a promotion, relocation, or launch, you are in the driver’s seat. Don’t hesitate—but don’t bulldoze either. Strategic ambition wins.",
  "reversed": "Reversed, The Chariot warns of scattered focus, impulsive decisions, or burnout. You may be trying to steer without knowing where you're going—or forcing progress when reflection is needed. Regroup. Clarify your intention. Then move."
 },
 "strength": {
  "name": "Strength",
  "number": 8,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/08-strength.png",
  "keywords": {
    "upright": ["Inner strength", "Compassion", "Courage", "Grace", "Resilience"],
    "reversed": ["Self-doubt", "Repression", "Weakness", "Avoidance", "Overwhelm"]
  },
  "description": "Strength is not loud. It is patient, rooted in love, and honest about pain. It doesn’t flinch—it opens its hands and holds still.",
  "visual_description": "Strength features Bradleigh, kneeling beside a roaring lion in a golden meadow at sunrise. He wears a cream gi with vine embroidery and a rainbow flower sash. A flower crown rests on his shaved head. His expression is calm, mischievous, and fully present.\n\nOne hand rests beneath the lion’s jaw, the other steadies its mouth—not restraining, but holding space. The lion blazes with trust. Behind them, Devil’s Tower rises—Brad summited it via the Durrance Route on 9/2/23, logging the first ascent of a crowded Labor Day weekend. This feat marks strength through belief and patience.\n\nAbove him floats the infinity symbol. Butterflies and wildflowers bloom around his feet, symbols of transformation and grace.\n\nThe border features four symbolic details: blood drops (top corners), a butterfly needle (lower left), and a runic RW monogram (lower right). These speak to Brad's lived reality as a gay hemo boi—vulnerability worn not as burden, but as quiet power.",
  "general_meaning": "Strength is the card of soft power. It calls on patience, resilience, and the ability to stay grounded in difficult moments. It reminds you that tenderness is not weakness—and that fierce compassion can shift everything. This is not the time to push or posture. It is the time to hold still, to breathe through the discomfort, and to honor your inner truth.",
  "love": "In love readings, Strength asks you to bring vulnerability to the surface. Are you trying to control love—or meet it gently, even when it scares you? This card suggests building trust slowly, showing up with honesty, and leading with empathy. It’s also about having the courage to walk away from relationships that dim your light.",
  "spiritual": "Spiritually, Strength reminds you that the heart is the most powerful muscle. It invites you to honor both your softness and your will. True growth doesn't come from escaping hardship, but from facing it with integrity. Let your spiritual practice hold space for your whole self—fears, flaws, and all.",
  "career": "Professionally, Strength can indicate a time to navigate tension with grace. You may be in a leadership position that requires steadiness, or facing a challenge that asks for quiet resilience. It’s not about being the loudest voice—it’s about being the calm center that others trust.",
  "reversed": "Reversed, Strength may point to insecurity, burnout, or a struggle to stand in your power. You might be repressing emotions or acting out of fear. It can also show up when you’re trying to appear strong instead of *being* strong. Take a breath. Soften. True courage includes rest, tears, and asking for help when needed."
 },
 "the_hermit": {
  "name": "The Hermit",
  "number": 9,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/09-the-hermit.png",
  "keywords": {
    "upright": ["Solitude", "Introspection", "Wisdom", "Guidance", "Inner journey"],
    "reversed": ["Isolation", "Withdrawal", "Loneliness", "Avoidance", "Disconnection"]
  },
  "description": "The way forward is not always out, but in. Clarity arrives in silence. The Hermit seeks no followers—only the truth of his own path.",
  "visual_description": "Ricky appears as the Hermit, cloaked in textured robes and leaning on a wooden staff, standing at the edge of a rocky outcrop in the Cirque of the Towers. His expression is serious, focused inward, his face partially shadowed by the hood.\n\nIn his right hand, he raises a metal lantern—simple, functional—casting a steady glow on the trail ahead. Its light feels sacred, earned through effort.\n\nThe background is notably sparse. Towering granite peaks surround him, drawn directly from the Cirque. There’s no village, no companions—only stone, ridgelines, and sky. The emptiness is deliberate: a space for reflection.\n\nMinimal ornamental elements frame the image. A faint sacred geometry symbol hovers above his hood, suggesting alignment with the eternal.\n\nThis is not a card of drama or spectacle, but of quiet clarity. It evokes solitude not as isolation, but as chosen stillness—an inward path lit from within.",
  "general_meaning": "The Hermit represents a turning inward. When this card appears, it’s time to withdraw from noise and seek your own light. This is not avoidance—it’s discernment. Something within you is asking to be heard, but only in silence can it speak.\n\nYou may be seeking clarity, healing, or deeper insight. Trust that your own inner lantern is enough to guide you through. There is wisdom in slowing down, in pulling back, in honoring the wilderness within.",
  "love": "In love readings, The Hermit can indicate space, healing, or a break from connection. If single, it may suggest a period of intentional solitude—one that clarifies what you truly want. If partnered, it may point to one or both people needing time alone to reflect.\n\nThis card doesn’t necessarily mean distance forever—but it does ask: are you growing alongside each other, or clinging out of fear? It’s a call to reconnect with your own truth before merging further.",
  "spiritual": "Spiritually, The Hermit is a pilgrimage. It signals deep introspection, a time when outer guidance fades and inner wisdom rises. You may be less interested in doctrine, more drawn to personal practice—walking, writing, sitting with the stars.\n\nThere may be discomfort in this kind of quiet, especially if you’re used to seeking answers outside yourself. But the lantern is lit. The way is slow, and holy.",
  "career": "In work or creative life, this card may suggest a solo venture, research phase, or time away from the spotlight. Step back from external validation. Not every idea needs immediate exposure.\n\nIf you're stuck, turn inward rather than pushing harder. Trust your instincts over trends. The Hermit’s message: create from integrity, not approval.",
  "reversed": "Reversed, The Hermit can indicate unhealthy isolation or avoidance. You may be retreating out of fear, hiding from life instead of seeking wisdom.\n\nAlternatively, you may be resisting solitude—distracting yourself from inner truths that want to be faced. The card may ask you to examine your relationship with aloneness. Are you using it to heal—or to disappear?\n\nFind balance. You don’t need to vanish to find yourself. But you do need to listen."
 },
 "wheel_of_fortune": {
  "name": "Wheel of Fortune",
  "number": 10,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/10-wheel-of-fortune.png",
  "keywords": {
    "upright": ["Cycles", "Destiny", "Karma", "Turning Point", "Synchronicity"],
    "reversed": ["Resistance to Change", "Bad Luck", "Disruption", "Unwelcome Surprises", "Clinging to Control"]
  },
  "description": "Fate spins, not to punish or reward, but to move. What rises may fall; what falls may rise. The only constant is change—and how you meet it.",
  "visual_description": "The Wheel of Fortune features Lia as a serene sphinx-like figure atop the great golden wheel. She wears a striped pharaonic headdress and holds a raised sword, symbolizing clarity and enigma. One paw rests on the wheel itself, anchoring her amid the swirl of fate.\n\nThe wheel is inscribed with two interlocking rings: the outer shows T-A-R-O and the Hebrew יהוה (YHWH), referencing divine mystery and the tarot’s cyclic nature. The inner ring resembles a compass rose or astrological glyphs, suggesting direction and cosmic order.\n\nSurrounding the wheel are four winged beings—a man, eagle, lion, and ox—each reading from a book, symbolizing elemental balance and enduring wisdom.\n\nA red Typhon descends on one side, and Anubis rises with a staff on the other, marking the wheel’s constant motion between gain and loss.\n\nClouds spiral in the background, evoking unseen forces. Lia’s expression remains calm, reminding us that even within chaos, stillness and clarity endure.",
  "general_meaning": "The Wheel of Fortune marks a turning point. It signals movement, change, and often events outside your control. Luck may be shifting—up or down—but the lesson is the same: hold your center.\n\nYou may feel as if the universe is steering events more than your choices are. Sometimes that’s true. But the Wheel reminds us that fortune turns, always. Whether this moment is blessing or challenge, it won’t last. What matters is your response.",
  "love": "In love, the Wheel can mean sudden changes—new love arriving by chance, or an unexpected shift in an existing relationship. It may speak to fate, karma, or a sense of being drawn toward something (or someone) meaningful.\n\nIf things have been stagnant, movement is coming. But it may not be what you expect. Be open to what unfolds, and avoid clinging to outcomes.",
  "spiritual": "Spiritually, this card is a reminder that time, karma, and destiny all move in cycles. You may be entering a phase of alignment or transition. Trust the larger pattern. Stay grounded, even as the sky spins.\n\nIt can also point to synchronicities—signs and repeating patterns—meant to guide you. Pay attention to what keeps showing up.",
  "career": "Career-wise, the Wheel may bring opportunity, unpredictability, or shifts in direction. Promotions, layoffs, mergers, and lucky breaks all fall under this card’s domain. The challenge is to stay flexible and responsive.\n\nIf you’ve been waiting for a sign to act—this may be it. Strike while the wheel is turning, but don’t get attached to any single outcome.",
  "reversed": "Reversed, the Wheel suggests resistance to change, or clinging to control in a situation that requires surrender. You may be feeling unlucky, stuck, or at the mercy of external events.\n\nThis card may ask you to loosen your grip. What patterns are repeating? What lesson is trying to be learned? Until it is, the wheel may spin in place.\n\nChange is inevitable. Growth is optional."
 },
 "justice": {
  "name": "Justice",
  "number": 11,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/11-justice.png",
  "keywords": {
    "upright": ["Truth", "Accountability", "Fairness", "Cause and Effect", "Balance"],
    "reversed": ["Injustice", "Denial", "Corruption", "Avoidance", "Imbalance"]
  },
  "description": "Justice sees clearly, speaks plainly, and balances without favor. Every action has a consequence—seen or unseen. This card asks you to act with integrity and accept what follows with grace.",
  "visual_description": "Tripp Tanzer (a.k.a. TTT / 三体) sits centered on a high-backed stone throne, robed in deep crimson with a golden mantle. His gaze is level and direct. A square gold crown rests on his head, symbolizing authority through structure and reason. In his right hand he holds an upright sword, slightly angled—a sign of intellect, action, and discernment. In his left, he holds a balanced golden scale, unladen and even, representing fairness and moral clarity. Behind him hangs a maroon curtain, flanked by stone columns. The throne is etched with ornate patterns, and beneath it rests a stylized eye-in-triangle, evoking higher awareness. His left foot extends forward, revealing a single white sneaker—a detail found in traditional depictions of Justice. The white shoe signifies purity of intention and personal responsibility in ethical choices. The whole composition is symmetrical, steady, and deliberate—underscoring clarity, accountability, and the enduring presence of truth.",
  "general_meaning": "Justice calls for truth, responsibility, and an honest look at the cause-and-effect forces shaping your life. You may be asked to make a fair decision, own your part in a situation, or hold others accountable.\n\nThis card affirms that integrity matters. If you’ve been wronged, Justice suggests that truth will come to light. If you’re avoiding accountability, it’s time to come clean. What you put out returns.",
  "love": "In relationships, Justice brings clarity and consequences. It may ask you to reflect on whether your partnership is fair, balanced, and rooted in mutual respect. Are both people being honest? Are both voices being heard?\n\nIt can also signal decisions around contracts, commitments, or legal matters like divorce or marriage.",
  "spiritual": "Spiritually, Justice asks you to align your actions with your values. It’s a reminder that karma operates through patterns—what you choose, how you treat others, and how you show up in difficult moments.\n\nThis card encourages discernment, honesty, and spiritual maturity. The path to wisdom often requires confronting uncomfortable truths.",
  "career": "In career readings, Justice may point to legal matters, contracts, or ethical dilemmas. You may be facing scrutiny or being asked to evaluate the fairness of your situation.\n\nThis is a card of accountability—what have you earned, and what have you avoided? Stand by your principles and document your choices.",
  "reversed": "Reversed, Justice may reveal dishonesty, bias, or corruption. You may be on the receiving end of an unfair decision—or avoiding responsibility for your own actions.\n\nThis card warns against denial and defensiveness. If things feel unbalanced, take a hard look at how you got here. If you’re being wronged, advocate clearly and persistently. Justice delayed is not always justice denied, but it must be pursued."
 },
 "the_hanged": {
  "name": "The Hanged",
  "number": 12,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/12-the-hanged.png",
  "keywords": {
    "upright": ["Surrender", "Perspective", "Pause", "Sacrifice", "Insight"],
    "reversed": ["Stagnation", "Resistance", "Delay", "Avoidance", "Martyrdom"]
  },
  "description": "Let go to see more clearly. The Hanged asks you to stop grasping, stop striving, and surrender to what is. Illumination arrives not through force, but inversion.",
  "visual_description": "Lív hangs serenely upside down from a wooden crossbeam, her right leg bent and hooked over the branch, the left relaxed and straight. She wears a soft, seafoam-blue LAKE patio dress with gentle ruffles at the sleeves and hem. Her legs are clad in rust-red pants, and on her feet are green Adidas Gazelles with classic white stripes.\n\nHer long golden hair falls freely toward the earth, creating a luminous fan around her inverted head. A radiant golden halo glows behind her, emphasizing calm awareness and transcendence. Her face is peaceful and gently smiling, suggesting clarity through surrender. She gazes out at the viewer from her reversed vantage with serene curiosity.\n\nThe background is filled with swirling, ink-like clouds in deep slate and cream tones, evoking movement and contemplation. Leaves frame the top of the image, just visible above the thick branch—grounding the composition in nature. There is no ground below her—only sky and the idea of perspective, suspended.",
  "general_meaning": "The Hanged indicates a time of pause and suspension. It calls for surrender—willingly letting go of control in order to gain a new perspective. This is not passive avoidance, but conscious stillness. What you sacrifice now—ego, timing, certainty—can reveal something deeper.\n\nIt’s a card of reversals: seeing things from another angle, stepping back, relinquishing urgency. By choosing stillness, you invite a shift in perception.",
  "love": "In love, The Hanged can signify uncertainty or a time of waiting. Rather than pushing for answers, this moment asks for patience and openness. You may need to let go of expectations, or see the other person in a new light.\n\nIt’s a reminder that clarity comes from allowing—not forcing.",
  "spiritual": "Spiritually, this card invites contemplation and surrender. You're being asked to trust the process—even when it feels upside down. Stillness is sacred. Wisdom will emerge from the pause.\n\nMeditate. Reflect. Loosen your grip on the outcome. This is the space in which true transformation begins.",
  "career": "Career-wise, The Hanged may point to delays, transitions, or a period of limbo. You may feel stuck or uncertain. The best move right now might be no move—waiting with intention rather than rushing forward.\n\nUse this time to reframe your goals and consider alternative approaches. Insight is coming, but it needs space.",
  "reversed": "Reversed, The Hanged suggests resistance to surrender. You may be clinging to control, unwilling to let go—even when doing so would bring peace. This can also reflect victimhood or playing the martyr, staying stuck by choice.\n\nYou’re being asked to shift your perspective. Let go of the need for immediate resolution. Stillness is not failure. It is the beginning of clarity."
 },
 "death": {
  "name": "Death",
  "number": 13,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/13-death.png",
  "keywords": {
    "upright": ["Endings", "Transformation", "Release", "Rebirth", "Inevitability"],
    "reversed": ["Resistance", "Stagnation", "Delayed change", "Fear of loss", "Clinging"]
  },
  "description": "Death is not the end—it is a threshold. This card signals transformation, often through release, loss, or the closure of one chapter to make way for another. Its lesson is surrender. Let go, and make space for what is next.",
  "visual_description": "Sid the cat rides calmly atop a pale horse, wearing dark armor with his tabby markings faintly visible. In one paw he holds a black banner marked with a white five-petal rose—symbol of purification and inevitable transformation. At the horse’s hooves lies Ti in his fallen Emperor regalia, crown toppled, body still. Death has come for kings before, and it will come again. To one side kneels Brad as the Hierophant, head bowed in reverence. On the other side is Summer, the Empress, hands pressed to her face in awe and sorrow. A young girl with flowers in her hair watches—innocence witnessing an ending. Behind them, a river winds toward the horizon, and a red sun rises between two towers—symbols of threshold and rebirth. The land is quiet, sparse, and earthy. Lilies bloom in the foreground, reminders that death nourishes life. This is not a card of violence or punishment—it is the cool hand of change made visible. Sid does not announce or delay it. He simply rides on.",
  "general_meaning": "Death heralds necessary transformation. Something must end—an identity, belief, relationship, habit, or role. This card asks you to release what no longer serves you, even if it once did. There may be pain in that letting go, but there is also freedom.\n\nThis is the compost of life. It is not a card of doom, but of rebirth. It clears the field for new growth. Trust the cycle.",
  "love": "In relationships, Death may mark the end of a phase—or even the relationship itself. But it can also signal the deep transformation of a bond, especially when one or both partners are growing or changing.\n\nLet go of attachment to how things were. If love continues, it will be reborn on new terms. If not, honor what was, and move forward.",
  "spiritual": "Spiritually, Death is a powerful threshold. Something in your old worldview may be dying. This is not a crisis—it’s an initiation. Your path is shedding skin. You may feel uncertain or lost. That’s the space before clarity.\n\nTrust in the process. Grieve, release, then begin again. This is sacred composting.",
  "career": "In work, Death can mean a job ending, a project wrapping up, or a career pivot on the horizon. It might feel like a door closing—but that may be a blessing in disguise.\n\nTake time to understand what is truly ending. Then shift your energy. Don’t resist the inevitable. Something new is waiting.",
  "reversed": "Reversed, Death suggests resistance. You may be holding on to something long past its expiration—out of fear, habit, or denial. This creates stagnation. You’re stuck in a chapter that wants to end.\n\nFace the fear of change. Acknowledge what’s dying. Releasing it is painful, but staying locked in place is worse.\n\nEvery ending holds a seed."
 },
 "temperance": {
  "name": "Temperance",
  "number": 14,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/14-temperance.png",
  "keywords": {
    "upright": ["Balance", "Harmony", "Patience", "Integration", "Flow"],
    "reversed": ["Imbalance", "Excess", "Fragmentation", "Restlessness", "Conflict"]
  },
  "description": "Temperance speaks to the art of calibration. It’s not just about restraint—it’s the creative blending of elements to produce something new. Healing, moderation, and flow come through gentle adjustment, not rigid control.",
  "visual_description": "Ricky appears as the serene angel of Temperance, standing in a stream that winds through a blooming, varied landscape. He wears a white robe marked with the alchemical symbol for water, and large red wings extend from his back. A glowing crown hovers above his dark, curled hair, surrounded by a soft golden halo. He pours water from one golden chalice to another, the stream bending mid-air in a curved arc shaped by invisible forces. His right foot touches the river lightly, while his left hovers just above—neither plunging in nor recoiling, poised in quiet balance. Behind him, a winding golden path leads to a distant Bear’s Lodge beneath a sunrise sky. Purple irises bloom on both banks, symbols of wisdom, growth, and emotional clarity. Spiraling clouds above echo the gentle rhythm below. This is a card of balance in motion—of patience not as stillness, but as flow: adaptive, quiet, and harmonized without force.",
  "general_meaning": "Temperance invites you to find your center. Rather than extremes or quick fixes, it asks for careful balance, quiet integration, and a trust in process. This card signals that healing and transformation come not from control, but from gentle adjustment over time.\n\nIt may also represent emotional regulation, spiritual synthesis, or the act of translating inner insight into outer action—step by step, day by day.",
  "love": "In love, Temperance points to relationships where mutual understanding and compromise are key. It encourages emotional maturity, honest communication, and healthy pacing—especially after a time of conflict or imbalance.\n\nIf single, this card suggests healing and self-integration that prepares you for deeper connection ahead.",
  "spiritual": "Spiritually, this card represents inner alchemy: the act of turning experience into wisdom. It asks you to blend what you’ve learned into a more complete self, without rushing the process.\n\nIt can also indicate a time of peaceful alignment with your path, where spiritual practices, insights, and daily life begin to harmonize.",
  "career": "In career matters, Temperance suggests collaboration, long-term planning, and the balancing of ambition with sustainability. It may point to team efforts where different skills and styles can be combined successfully.\n\nAvoid extremes. Stay steady and responsive. This is not the time to force things—it’s the time to cultivate a rhythm that lasts.",
  "reversed": "Reversed, Temperance can indicate disharmony, impatience, or overcorrection. You may be swinging between extremes, pushing too hard, or failing to blend parts of your life that need reconciliation.\n\nTake a breath. Step back. Where can you reduce friction, ease tension, or reestablish flow? The solution lies in subtle shifts, not dramatic swings."
 },
 "the_devil": {
  "name": "The Devil",
  "number": 15,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/15-the-devil.png",
  "keywords": {
    "upright": ["Temptation", "Attachment", "Shadow Self", "Addiction", "Illusion"],
    "reversed": ["Liberation", "Awareness", "Breaking Free", "Detachment", "Recovery"]
  },
  "description": "The Devil card represents the seductive pull of illusion, desire, and self-imposed bondage. It speaks not of evil as a cosmic force, but of the ways we trick ourselves into staying stuck—chained by ego, addiction, or fear. It is a mirror to our shadows, asking: what are you serving? And who holds the key?",
  "visual_description": "Kenan appears as the horned, hairy lord of indulgence and rebellion, seated atop a stone pedestal amid swirling smoke and blue-black clouds. His eyes gleam with knowing mischief, and a golden inverted pentagram glows behind his head like a taunting halo. He wears an Abyssal Frost denim battle vest—definitely not a Double E’s cut—and grips a flame-etched electric guitar shaped like a hellish chalice. One hand flashes the metal horns, bridging satire and summon. Below him, two chained figures—one with grapes on her tail, the other with a flame—kneel at the pedestal’s base, wrists loosely bound. Their faces suggest discomfort tinged with desire, unsure if they want escape or just more of the same. The background swirls with smoke and twisted gothic archways, blending concert poster and cathedral fresco. It’s richly textured, heavy with irony. Kenan’s devil doesn’t need to trap you—you’re already holding the leash.",
  "general_meaning": "This card surfaces when we’re grappling with powerlessness, unhealthy attachments, or denial. The Devil asks you to examine what’s really binding you—and why you may be choosing to stay bound. There’s always a way out. But first, you must want it.\n\nIt may also appear when obsession, temptation, or fear is clouding your judgment. Be honest about the illusions you’ve accepted.",
  "love": "In relationships, The Devil can signal codependency, lust without depth, or patterns of control and manipulation. It may also highlight an inability to let go of someone—even when you know it’s hurting you.\n\nAlternatively, it can speak to raw passion, irresistible attraction, or taboo dynamics. The key is whether the bond empowers or ensnares.",
  "spiritual": "Spiritually, this card is a shadow work invitation. Where are you giving your power away? What do you avoid seeing? It may point to unconscious patterns, shame, or buried impulses asking for integration—not repression.\n\nFreedom comes through awareness, not rejection. The Devil dares you to look deeper and reclaim your wholeness.",
  "career": "Career-wise, The Devil may represent a toxic work environment, golden handcuffs, or unsustainable ambition. It could also reflect burnout, over-identification with success, or fear-based choices.\n\nThis card asks you to consider: what are you sacrificing, and is it worth it? What fear is driving your hustle?",
  "reversed": "Reversed, this card signals the start of liberation. You may be recognizing the illusion or seeing the chains for what they are. It’s a sign you’re ready to let go of limiting beliefs or toxic patterns.\n\nAlternatively, it can warn of deeper denial—clinging even harder to what no longer serves you. Don’t numb out. Wake up."
 },
 "the_tower": {
  "name": "The Tower",
  "number": 16,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/16-the-tower.png",
  "keywords": {
    "upright": ["Upheaval", "Sudden Change", "Revelation", "Collapse", "Truth"],
    "reversed": ["Avoidance", "Inner Upheaval", "Denial", "Lingering Disaster", "Delayed Awakening"]
  },
  "description": "The Tower brings the lightning. When illusions fall, so do we. But in the ruins lies clarity—what remains is what’s real. This card signals rupture, sudden change, or an ego unseated by truth. It hurts. But it clears the way.",
  "visual_description": "Two figures—Brad and Ricky—plummet from a jagged, crumbling tower struck by a violent bolt of lightning. The sky is thick with smoke and fire. Red flames curl upward, licking at broken stone and night clouds alike.\n\nBrad is shown in full panic, his body flailing as both his crown and voluminous wig arc through the air above him. He reaches not for the crown, but for the wig—eyes wide, desperate to recover at least that part of his fallen glory.\n\nRicky, falling on the other side, is more composed. Though his wig has also been cast off in the explosion, his limbs are relaxed, and his expression is one of almost meditative surrender. He seems to know it’s over—and maybe even that it needed to be.\n\nThe tower itself is torn apart, flames pouring from every breach. The top has been blasted open, and cracks race down the stone like veins. Crowns fly, illusions fall. It is not subtle.",
  "general_meaning": "The Tower is disruption in its rawest form. A shock. A truth. A sudden unraveling. It might be a breakup, a job loss, a realization that undoes everything you believed. But whatever it is, it’s meant to break what was already unstable.\n\nThis card asks for brutal honesty and a willingness to begin again. After destruction, clarity. After collapse, freedom.",
  "love": "In love, The Tower can signify a breakup, a betrayal, or a sudden confrontation that shatters illusions. It may not be pleasant, but it’s necessary. Something unstable couldn’t stand—and now you’re free to see the truth.\n\nIf single, this may mean a rapid, shocking encounter that changes your view of love itself.",
  "spiritual": "Spiritually, this card is an awakening via demolition. Something in your worldview is being torn down. A belief, a pattern, or an identity may be falling apart. This can feel disorienting—but it’s sacred work.\n\nYou’re being stripped down to what’s real. Don’t cling to what’s burning.",
  "career": "Career-wise, The Tower could mean sudden layoffs, failures, or the collapse of a professional plan. Something has gone sideways—but that doesn’t mean the end. It may force you to pursue a truer path, one less built on false assumptions.\n\nLet what’s unstable fall. Rebuild with awareness.",
  "reversed": "Reversed, The Tower may suggest that you’re avoiding an inevitable collapse. You feel the rumblings, but you’re still trying to hold up a structure that’s past saving. Let go.\n\nIt can also mean the upheaval is internal: a crisis of identity or belief, quietly breaking down inside you.\n\nWhether outward or inward, the lesson is the same: break to rebuild."
 },
 "the_star": {
  "name": "The Star",
  "number": 17,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/17-the-star.png",
  "keywords": {
    "upright": ["Hope", "Renewal", "Healing", "Clarity", "Faith"],
    "reversed": ["Despair", "Insecurity", "Disconnection", "Lack of direction", "Doubt"]
  },
  "description": "The Star is a beacon after the storm. It arrives softly, guiding us back to our center. This card is hope renewed—not as naïve optimism, but as grounded clarity. It reminds us we are part of a greater pattern, and that healing is always possible.",
  "visual_description": "Lamorris kneels at the edge of a reflective pool, dressed as the Green Ranger—an homage to the archetype of unexpected help. His demeanor is peaceful, his face tilted gently upward toward a single radiant eight-pointed star. Surrounding the star are seven floating dandelion seeds, drifting in the sky like forgotten wishes taking flight.\n\nLamorris wears Brad’s wig from the previous Tower card—an oddly touching gesture, blending humor with cosmic continuity. He appears blind, his gaze inward. He pours water from both hands into the pool; the stream from his left hand splits into four channels as it hits the surface, suggesting the absence of one of the five senses.\n\nTo the left, a tufted titmouse perches on a full dandelion seed head. The landscape is calm and fertile, framed with lush stylized foliage. This is a card of stillness, presence, and gentle realignment.",
  "general_meaning": "The Star represents a moment of healing, grace, and reorientation. It’s the calm after the storm, the deep breath after collapse. You may find yourself reconnecting to purpose, or simply to your own stillness.\n\nThis card invites vulnerability, trust, and alignment. Follow the signs, even if you can’t see the whole path. Faith doesn’t require proof—only presence.",
  "love": "In love, The Star suggests healing after difficulty or a renewed sense of emotional connection. If you’re recovering from heartbreak, this card affirms that something truer and gentler is ahead.\n\nIt can also point to a bond that restores your faith in love—not flashy, but honest and steady.",
  "spiritual": "Spiritually, The Star is a return to source. You may feel more attuned to intuitive messages, dreams, or symbols. This is a time for purification and reconnection—to yourself, to spirit, to trust.\n\nAcknowledge what has been lost. Then notice what is still shining.",
  "career": "Career-wise, this card can indicate hope restored after a setback or a guiding light toward more aligned work. You may be finding clarity in your values, or receiving help from an unexpected source.\n\nLet your next steps come from inner knowing, not outer pressure.",
  "reversed": "Reversed, The Star can point to discouragement, cynicism, or a loss of belief in your own path. You may feel disconnected from your purpose or overwhelmed by doubt.\n\nThis is a time to care gently for yourself. Reconnect to your inner compass. Healing is still possible—but it begins with believing that it is."
 },
 "the_moon": {
  "name": "The Moon",
  "number": 18,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/18-the-moon.png",
  "keywords": {
    "upright": ["Illusion", "Intuition", "Uncertainty", "Dreams", "Subconscious"],
    "reversed": ["Confusion", "Fear", "Repressed emotions", "Paranoia", "Avoidance"]
  },
  "description": "The Moon whispers through dreams, not declarations. It represents what’s hidden, hazy, or emotionally charged. Illusions are active; instinct is heightened. Proceed, but gently. What feels real may be shadow or symbol.",
  "visual_description": "At the center of a swirling night sky, the Moon appears with Brad’s face—softly illuminated, watchful, and slightly amused. Below, Pebble and Sid sit at the water’s edge, howling upward in mirror pose. Their cries ripple the landscape, a soundless pull to something ancient.\n\nBetween them, a lobster rises from the water, its claws open as it begins the journey up the winding path. That path snakes toward two towers in the background—set against a mountain range unmistakably modeled on Giuseppe Pingora’s Peak and Wolf’s Head in Wyoming’s Cirque of the Towers.\n\nThe entire scene is infused with curls of mist, stylized clouds, and dreamlike flourishes. This is a realm of the subconscious and symbolic—a card that asks more questions than it answers.",
  "general_meaning": "The Moon card reflects a time of uncertainty, dreams, or emotional intensity. Things may not be what they seem. Trust your gut more than appearances. Move slowly and let intuition guide you.\n\nSometimes, the Moon reveals buried feelings or long-lost fears surfacing again. Don’t rush to fix or define—just notice. What’s unclear now will come into focus later.",
  "love": "In relationships, the Moon can point to emotional confusion, projection, or unspoken fears. You or your partner may be acting from insecurity or illusion. This is a time for patience—not big decisions.\n\nIf single, your attraction to someone may be based more on fantasy than reality. Let time and clarity emerge before jumping in.",
  "spiritual": "Spiritually, the Moon opens a gateway to dreams, intuition, and shadow work. You may receive insight in non-rational ways—symbols, dreams, synchronicities.\n\nIt’s also a time for caution: not everything coming up now is trustworthy. Use discernment. Let what’s unclear stay unclear until it’s ready.",
  "career": "In work, this card suggests unclear circumstances or workplace dynamics driven by rumor, insecurity, or hidden agendas. Avoid overanalyzing. Instead, document your decisions, stick to facts, and wait for clarity.\n\nThe Moon may also indicate a creative phase driven by unconscious inspiration—trust the muse, but double-check the contract.",
  "reversed": "Reversed, the Moon can reveal that confusion is lifting—or that fear is clouding your instincts. You may be doubting your inner voice or stuck in old illusions. This is a call to slow down, center yourself, and reflect.\n\nIt may also point to emotional overwhelm or anxiety. Create space to ground. Not every feeling is fact—but all deserve compassion."
 },
 "the_sun": {
  "name": "The Sun",
  "number": 19,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/19-the-sun.png",
  "keywords": {
    "upright": ["Joy", "Clarity", "Confidence", "Success", "Vitality"],
    "reversed": ["Ego", "Overexposure", "Burnout", "Disillusionment", "False optimism"]
  },
  "description": "The Sun signals a moment of radiant clarity and joy. It’s a card of vitality, celebration, and affirmation. What you need is already within you. Let it shine. The Sun reminds you that it’s not indulgent to feel good—it’s essential.",
  "visual_description": "Ricky appears here as Cowboy Chu—bare-chested and beaming, riding a prancing unicorn across a sea of radiant waves. He waves a long rainbow banner that arcs across the sky, brushing the radiant sun behind him. That sun bears a calm, beatific face, its rays curling in spirals of gold and flame.\n\nRicky wears the first true Double E’s battle vest seen in the deck, decorated with enamel pins and patches. His bare feet are subtly transforming into horse hooves—suggesting a merging with his mount, or a symbolic surrender to joy and movement.\n\nFlanking the bottom of the card are two vibrant sunflowers, their stems curling upward toward the light. The composition is both triumphant and playful—a nod to queerness, transformation, and pure unfiltered joy.",
  "general_meaning": "This is a card of light and confidence. When The Sun appears, something is being illuminated—whether truth, purpose, or deep self-assurance. There’s nothing to fear. Step into visibility. Be proud of where you are and what you bring.\n\nThe Sun may indicate a time of personal breakthrough, success, or public recognition. You are aligned with your truest energy.",
  "love": "In love, The Sun suggests warmth, honesty, and a shared sense of play. It’s a great sign for relationships built on mutual joy and transparency. If single, it signals attraction sparked by authenticity and self-love.",
  "spiritual": "Spiritually, The Sun is an invitation to align with your inner light. There’s no need to search—just to express and allow. When you lead with joy, clarity follows. Return to the basics of your spiritual practice and let them nourish you.",
  "career": "Career-wise, The Sun heralds success, confidence, and momentum. Projects move forward with energy. You may be in the spotlight—own it with humility and openness. If you’ve been questioning your path, this card says: you’re on it.",
  "reversed": "Reversed, The Sun warns of overexposure, false positivity, or burnout from chasing too hard. You might be performing joy instead of feeling it.\n\nIt’s also possible you’re struggling to feel good even in the midst of success. Return to what nourishes you. The light is still there—don’t let pressure steal your joy."
 },
 "judgement": {
  "name": "Judgement",
  "number": 20,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/20-judgement.png",
  "keywords": {
    "upright": ["Awakening", "Redemption", "Inner Calling", "Reckoning", "Transformation"],
    "reversed": ["Avoidance", "Self-doubt", "Denial", "Stagnation", "Failure to heed the call"]
  },
  "description": "Judgement heralds a reckoning—an invitation to rise, reflect, and step into a greater version of yourself. It's a card of spiritual clarity, where past actions and hidden truths come into view. The call is loud. The time is now.",
  "visual_description": "Levon appears as the angel Gabriel, floating high above the scene with trumpet in hand. His wings are outstretched, halo radiant, and expression calm but focused as he issues the divine call.\n\nBelow him, five familiar figures respond in varied and deeply personal ways: Lia frowns, skeptical or perhaps disapproving; Summer gazes upward, steady and serene; Ricky shields his eyes in awe or disbelief; Tripp clasps his hands in solemn reflection; and Brad appears to have suffered a stroke, his face askew in confusion, body only partially risen.\n\nThe background is misty and sepia-toned, evoking both dream and afterlife. The figures emerge from open coffins or stone slabs—caught in a moment between death and return. Together, they mirror the card’s core meaning: not perfection, but the unflinching embrace of truth, with all its awkwardness and grace.",
  "general_meaning": "Judgement asks: Are you ready to move forward, fully and honestly? This card signals a powerful shift—a moment where you're being asked to take stock, release baggage, and accept who you've been in order to evolve. You can't fake this kind of transformation. It's a full-body yes to the call of becoming.",
  "love": "In relationships, Judgement can bring up the past—old patterns, unresolved feelings, or long-buried truths. But it also offers healing and renewal. This is a chance to see your connections clearly and decide, with honesty, what comes next.",
  "spiritual": "Spiritually, Judgement points to a breakthrough. You may be awakening to a deeper truth or being asked to step into a role or identity you've avoided. The path ahead may require forgiveness—especially of yourself. Let go. Rise up.",
  "career": "Career-wise, this card marks a turning point. You may be called to change paths, take on new leadership, or finally confront something you've been avoiding. If you've done the work, recognition is coming. If not, now’s the time to face it.",
  "reversed": "Reversed, Judgement indicates hesitation or refusal to answer the call. You might be avoiding consequences, clinging to an outdated version of yourself, or doubting your readiness.\n\nThe fear is understandable—but the moment won't wait forever. Clarity begins when you stop running."
 },
 "the_world": {
  "name": "The World",
  "number": 21,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/21-the-world.png",
  "keywords": {
    "upright": ["Completion", "Wholeness", "Integration", "Achievement", "Alignment"],
    "reversed": ["Delay", "Fragmentation", "Lack of closure", "Disconnection", "Unfinished business"]
  },
  "description": "The World is the final card in the Major Arcana—a culmination of the journey and a return to the self, now transformed. It speaks to integration, unity, and arriving fully where you are. The dance continues, but now you move with rhythm.",
  "visual_description": "An androgynous figure in flowing lavender dances mid-stride, hair styled in a galaxy-dyed queer mullet of purple, magenta, and blue. They hold two wands, echoing the Magician and the cyclical flow of creation. A laurel wreath encircles them, symbolizing triumph and continuity. In each corner stands a ‘Core Four’ member in spirit animal form: Ricky is a graffiti-tagging bobcat in a hoodie (Air / Swords). Brad appears as a soft-eyed owl with tie-dye feathers and a heart-shaped chest mark (Water / Cups). Kenan is a bison with an electric guitar and feathered horns (Fire / Wands). Ti stands as a bear in a lab coat, calm and grounded (Earth / Pentacles). Behind them glows Metatron’s Cube, radiating harmony and the unity of all elements. The sky shifts in a soft celestial gradient, evoking dawn or dusk—a threshold between endings and beginnings.",
  "general_meaning": "The World marks completion, not as a finish line but as an arrival—fully present, fully integrated. You’ve come through challenge, doubt, and growth, and now you see the connections. You are the dancer and the dance.",
  "love": "In love, The World represents harmony and mutual understanding. A relationship may be reaching a new milestone—fulfillment, travel together, or simply feeling like you're truly seen. If you're alone, this card radiates self-love and peace within your own orbit.",
  "spiritual": "This is a card of spiritual alignment. You may feel a deep sense of purpose, clarity, or connection to a larger pattern. Your inner and outer worlds are syncing. Take a breath—this is sacred ground.",
  "career": "A major cycle may be closing at work: a promotion, completed project, or new opportunity that comes from hard-earned skill. It’s also a reminder to acknowledge your wins and reflect before starting the next chapter.",
  "reversed": "Reversed, The World suggests something’s unfinished. A missing piece, a missed closure, or a reluctance to move on. It can also mean over-identifying with roles or narratives that no longer serve. You don’t need to be everything to everyone. Real completion starts with truth."
 },
  "ace_of_cups": "ace_of_cups": {
  "name": "Ace Of Cups",
  "number": 1,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/22-ace-of-cups.png",
  "keywords": ["Emotional renewal", "Creative flow", "Love", "Spiritual openness", "Receiving"],
  "description": "The Ace of Cups in the Ricky-Wahité Tarot overflows with feeling, intuition, and openness to connection. It represents a vessel for new emotional experience—pure, present, and unguarded.",
  "visual_description": "A hand reaches from swirling clouds, holding a wide-mouthed Nalgene bottle in place of a chalice. From its opening, five streams of water burst upward, while droplets spill downward into a tranquil lotus pond below. A dove descends, placing a stamp with lips into the bottle. Stickers decorate the bottle: a peach with a heart-shaped mountain, a single red drop, a pine silhouette, a swirling wave, and an eight-pointed star.",
  "general_meaning": "This card signifies an emotional or spiritual fresh start. It’s an invitation to love freely, listen inwardly, and allow creative or intuitive energies to rise and move through you.",
  "love": "A new relationship or a deepening of emotional bonds. You may be opening your heart in a more vulnerable or genuine way than before.",
  "spiritual": "A heightened awareness of beauty, intuition, and inner peace. Let your heart guide you as a sacred compass.",
  "career": "A creative breakthrough or a role that allows for emotional expression, connection, or nurturing energy. A project may begin to ‘flow’ in a surprising way.",
  "reversed": "Blocked emotions, creative stagnation, or emotional burnout. It can suggest difficulty receiving love or being closed off to deeper experience."
},
  "two_of_cups": {
  "name": "Two of Cups",
  "number": 2,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/23-two-of-cups.png",
  "keywords": ["Connection", "Union", "Mutuality", "Trust", "Partnership"],
  "description": "Aang and Katara raise their golden cups in a moment of shared harmony and mutual recognition. The Two of Cups symbolizes emotional reciprocity, tender beginnings, and sacred bonds formed through honesty and vulnerability.",
  "visual_description": "Aang and Katara stand chest-deep in water, facing each other, each holding a golden cup. Between them floats a caduceus symbol with a winged lion’s head above it—an emblem of energetic union and protection. Gentle mountains and a small house rest in the distant background, while swirling waves surround their forms below.",
  "general_meaning": "This card speaks to emotional balance between two people, the spark of a meaningful relationship, or a heartfelt agreement. It may mark a new connection, a reconciliation, or a moment of mutual trust.",
  "love": "Deep attraction, mutual respect, and the start of something real. Whether romantic or platonic, this is the kind of bond that heals and grows both people involved.",
  "spiritual": "A reminder that union can be sacred. You may be called to practice vulnerability with another, or you may be receiving spiritual insight through a relationship.",
  "career": "New partnerships, collaborations, or shared creative endeavors. Agreements reached now are likely to benefit from mutual understanding and emotional intelligence.",
  "reversed": "Miscommunication, imbalance, or emotional disconnect. Be cautious of one-sided dynamics or an avoidance of honest connection."
},
  "three_of_cups": {
  "name": "Three of Cups",
  "number": 3,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/24-three-of-cups.png",
  "keywords": ["Celebration", "Friendship", "Community", "Support", "Joy"],
  "description": "Cady, Janice, and Damien raise red party cups in spirited unison. This card is a tribute to friendship that nourishes, laughter that heals, and moments that remind you—you don’t have to do it alone.",
  "visual_description": "Three friends stand in joyful embrace, arms raised with red solo cups. Janice wears her signature dark layers, Damien dons a blue hoodie and sunglasses, and Cady glows in autumn tones. They’re surrounded by flowers, fruit, and a pumpkin, all bursting with abundance and warmth under a swirling sky.",
  "general_meaning": "A moment of connection, celebration, or shared relief. Whether it's a party, a reunion, or just a night out with your people, this card invites you to embrace joy in community and honor the power of chosen family.",
  "love": "Supportive friendships create the foundation for lasting love. You may find romance through your circle—or realize that friendship is the real magic right now.",
  "spiritual": "Rejoice in the sacredness of shared joy. Healing and transformation often come through connection and collective expression.",
  "career": "Collaboration is the key to success. Celebrate a milestone with your team, recognize your contributions, or start a creative group endeavor.",
  "reversed": "Isolation, jealousy, or feeling left out. Check in with your need for connection and resist the urge to compare or compete."
},
  "four_of_cups": {
  "name": "Four of Cups",
  "number": 4,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/25-four-of-cups.png",
  "keywords": ["Discontent", "Apathy", "Withdrawal", "Re-evaluation", "Missed Opportunities"],
  "description": "Zihan sulks beneath a tree in full emotional retreat, arms crossed and brow furrowed, completely ignoring the divine swirl of soft serve being offered from beyond the frame. This card is the spiritual shrug emoji—dripping with mood, and a refusal to engage.",
  "visual_description": "Zihan sits cross-legged under a tree in a blue parka, arms crossed and eyes scrunched shut. Three cups of swirled soft serve sit untouched before him, while a fourth floats beside his head, offered by a mysterious hand. Falling leaves swirl in the air, echoing his inner storm of adolescent angst.",
  "general_meaning": "The Four of Cups asks you to examine what you’re turning away from. Something may be offered—a chance, an emotion, a connection—but your gaze is fixed inward. Withdrawal can serve a purpose, but don’t miss what’s blooming at the edge of your vision.",
  "love": "You may be too preoccupied with disappointment or past wounds to recognize new possibilities in love. Give yourself grace, but stay open.",
  "spiritual": "A time for emotional rest and reset. Stillness can reveal the deeper longing beneath the malaise—if you're willing to look.",
  "career": "Work might feel stale or uninspiring. Are you missing the signs of a new path forming? Take stock before dismissing it all as meaningless.",
  "reversed": "Emerging from emotional stagnation. A renewed interest in life. Or alternately, deeper disengagement—beware of numbing out."
},
  "five_of_cups": {
  "name": "Five of Cups",
  "number": 5,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/26-five-of-cups.png",
  "keywords": ["Regret", "Grief", "Forgiveness", "Emotional Loss", "Reconciliation"],
  "description": "Zuko kneels beside a stream, cloaked in sorrow, his head bowed and his gaze fixed on the three spilled cups before him. Yet behind him, two remain untouched—steam rising from one. In the distance, Iroh’s tent glows softly with warmth. This moment captures the heavy pause before a turning point, when remorse meets the potential for redemption.",
  "visual_description": "Zuko, in a dark cloak with gold trim, sits in shadowed solitude near a riverside, eyes downcast. Three cups spill onto the grass before him, while two remain upright on a tree stump beside him, steam curling upward. Behind him, a red-trimmed tent rests quietly across a bridge, waiting.",
  "general_meaning": "This card acknowledges grief and disappointment but gently reminds you not all is lost. Behind the sorrow lies a path toward healing—if you're willing to look up and walk it.",
  "love": "Regret may be clouding your ability to love or trust. Healing is possible—but it starts with facing what hurt you.",
  "spiritual": "You may be sitting with loss, confusion, or a feeling of spiritual disconnection. Reflection and ritual can help you rediscover your inner peace.",
  "career": "A setback, miscommunication, or missed chance may be weighing on you. Don’t let regret blind you to new opportunities quietly presenting themselves.",
  "reversed": "Moving through grief. Forgiveness offered or received. A second chance becomes visible—but only if you're ready."
},
  "six_of_cups": {
  "name": "Six of Cups",
  "number": 6,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/27-six-of-cups.png",
  "keywords": ["Nostalgia", "Innocence", "Reunion", "Tenderness", "Memory"],
  "description": "Inspired by the closing scene of *Kung Fu Hustle*, two children—representing the boy and lollipop girl—exchange a golden cup filled with flowers and lollipops. Behind them, an older man walks away into mist, a symbolic farewell to the past self. The card evokes simplicity, sweetness, and the sacred return to joy once known.",
  "visual_description": "Two children in traditional clothing stand amid ornate golden cups brimming with flowers. One boy offers a central cup to a girl, smiling warmly. Lollipops rise among the blooms. Behind them, a man walks into swirling clouds and a distant cityscape, fading into memory.",
  "general_meaning": "A card of sweet memory, kindness, and moments that soften the soul. It invites you to reconnect with something or someone that once brought you peace, and to carry that feeling forward.",
  "love": "A relationship may be rekindling, or a familiar love is offering new warmth. Emotional comfort and shared memories strengthen the bond.",
  "spiritual": "Return to the roots of what made your heart open. Healing comes through remembering what joy once felt like—and honoring it.",
  "career": "Consider past passions or collaborators—something old may hold the key to something new. A gesture of goodwill may open a door.",
  "reversed": "Trapped in the past. Overidealizing nostalgia. Refusing to grow up. It may be time to let go of what was in order to receive what could be."
},
  "seven_of_cups": {
  "name": "Seven of Cups",
  "number": 7,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/28-seven-of-cups.png",
  "keywords": ["Illusion", "Temptation", "Fantasy", "Overwhelm", "Choices"],
  "description": "‘Genie Joe Dream’ takes form as Morpheus from *The Sandman*, styled like Joe Jackson on the *I’m the Man* cover—offering up a trench coat lined with fantastical options. A shadowy figure stands before him, caught between awe and paralysis. The card asks: when every dream is available, which one do you choose—and at what cost?",
  "visual_description": "Morpheus opens a smoky trench coat filled with seven cups, each holding an archetypal lure: a glowing orb, a serpent, a red dragon, a castle, riches, a veiled ghost, and a golden-haired bust. Clouds swirl around them, and a shadowy figure in the foreground reaches out in indecision.",
  "general_meaning": "Too many options can cloud the path. Fantasy is seductive, but not all choices are real or wise. Discernment is key.",
  "love": "Romantic illusions may obscure reality. Are you projecting desire onto someone rather than seeing who they truly are?",
  "spiritual": "You may be wandering in dream realms—pay attention to symbols and intuition, but don’t lose grounding.",
  "career": "So many paths—so much potential. But without clarity, progress may stall. Pick one cup and act.",
  "reversed": "Escaping into illusion. Paralysis from fear of making the wrong choice. Or conversely—clarity finally emerging from confusion."
},
  "eight_of_cups": {
  "name": "Eight of Cups",
  "number": 8,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/29-eight-of-cups.png",
  "keywords": ["Departure", "Letting Go", "Seeking", "Emotional Maturity", "Purpose"],
  "description": "Inspired by Mulan’s quiet, resolute departure, this card captures the moment one walks away from comfort toward an unknown but necessary path. Eight golden cups remain behind—perfectly stacked, but incomplete. The figure rides under a full moon, trading stability for self-honor. Sometimes leaving is the most powerful choice.",
  "visual_description": "A cloaked rider—Mulan—travels on horseback under a radiant full moon, moving toward distant mountains. Eight cups are arranged in the foreground, one conspicuously missing from the perfect formation. The road reflects moonlight, winding through swirling mist and bamboo groves.",
  "general_meaning": "Emotional clarity leads to departure. You're no longer fulfilled by the familiar and are drawn toward something deeper.",
  "love": "You may be outgrowing a relationship or pattern. Walking away could bring the healing or discovery you’ve been avoiding.",
  "spiritual": "A turning point on your spiritual journey. You’re answering an inner call, even if it means leaving behind what once defined you.",
  "career": "This job or role no longer aligns. The courage to leave—even without a full plan—may open you to greater alignment.",
  "reversed": "Avoiding the call. Clinging to what no longer serves. Emotional stagnation or fear of change keeping you stuck."
},
  "nine_of_cups": {
  "name": "Nine of Cups",
  "number": 9,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/30-nine-of-cups.png",
  "keywords": ["Satisfaction", "Gratitude", "Emotional Fulfillment", "Contentment", "Pleasure"],
  "description": "Iroh brews tea with peaceful joy in the Jade Dragon teahouse, surrounded by nine ornate cups arranged above him like blessings earned. His smile is subtle, satisfied—not boastful. This card reminds us that fulfillment is found not only in big victories, but in daily rituals, chosen contentment, and authentic joy.",
  "visual_description": "Uncle Iroh smiles warmly while preparing tea, steam curling from the pot in organic swirls. Nine decorated teacups sit on a shelf above him, forming a gentle arc. Behind him is a mandala-style wood carving evoking harmony and internal balance.",
  "general_meaning": "Wishes fulfilled. You’ve cultivated a life of emotional richness—now take time to enjoy it.",
  "love": "A time of romantic satisfaction or solo emotional completeness. You feel good in your own skin—and others are drawn to that.",
  "spiritual": "Inner peace and a steady heart. You've learned to honor the sacred in the ordinary. Your cup overflows inward first.",
  "career": "Professional satisfaction is high. Recognition, results, or stability—enjoy it, but stay humble and aligned.",
  "reversed": "Shallow gratification. Chasing pleasures without fulfillment. A reminder to seek substance over sparkle."
},
  "ten_of_cups": {
  "name": "Ten of Cups",
  "number": 10,
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/31-ten-of-cups.png",
  "keywords": ["Harmony", "Fulfillment", "Wholeness", "Emotional Security", "Shared Joy"],
  "description": "The Ricky-Wahité family gathers under a glowing aurora rainbow in a peaceful polar landscape. Four adults stand together near a warm fire, while two children play joyfully in the snow. Behind them sit Pebble, Sid, and a kitten—two of them towering spirit-cats with antlers. The Satomobile, JTT, rests near an igloo. Above it all, ten cups arc across the sky like a constellation of joy and belonging.",
  "visual_description": "Four adults stand at the edge of a snowy bluff, watching a rainbow aurora beneath a starry sky. Two children snowball fight near an igloo in the background. Pebble, Sid, and a kitten sit nearby—two are giant antlered cats. Ten golden cups arc across the sky. A Subaru-style satomobile rests in the snow. Mountains and pines surround the valley.",
  "general_meaning": "Emotional completion and collective joy. You've built something real—with love at the center.",
  "love": "Deep connection, shared purpose, chosen family. This is the 'happy ending'—but not the end.",
  "spiritual": "You’ve found spiritual peace in community. The self dissolves into something beautiful and bigger.",
  "career": "Work-life alignment. Shared victories or a project reaching its ideal form. Celebrate the bonds that helped get you here.",
  "reversed": "Idealism unmet. Family strain or emotional disconnect. Reflect on what you’ve built—and what you still need."
},
  "page_of_cups": {
  "name": "Page of Cups",
  "number": 11,
  "title": "Let Me In, Let’s Begin",
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/32-page-of-cups.png",
  "keywords": ["Curiosity", "Creative Spark", "Playfulness", "Emotional Openness", "Invitation"],
  "description": "Mica, dressed in flowing indigo, balances mid-step with a cup extended before her—waves crash and swirl behind her, while Matt plays a keyboard in the mist. A fish peers from her chalice. A winged mirror pulses with checkered depth, suggesting portals of perception and imagination. This is the dream-pop dreamer—curious, fluid, and emotionally alive.",
  "visual_description": "Mica stands poised in billowing pants, holding a golden cup with a fish emerging. Behind her, Matt plays keys with quiet focus. A winged mirror with a spiraling black-and-white pattern floats above crashing waves. Gold filigree frames the clouds and sea.",
  "general_meaning": "A messenger of emotional insight and creative play. Stay open to wonder and intuition.",
  "love": "A new connection may feel surreal and sweet. Let your heart explore without fear.",
  "spiritual": "You're ready to receive subtle messages. Tune in with softness and trust.",
  "career": "Creative opportunities or artistic breakthroughs. Stay curious—even if you feel unqualified.",
  "reversed": "Emotional immaturity or avoidance. Don’t flee from feelings—name them, and begin."
},
  "knight_of_cups": {
  "name": "Knight of Cups",
  "number": 12,
  "title": "Keep A Place For Me",
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/33-knight-of-cups.png",
  "keywords": ["Romanticism", "Intuition", "Journey", "Invitation", "Artistry"],
  "description": "Frank Ocean rides a white horse through Castle Valley, his armor glinting under the desert sun. A swirling blue cloak embroidered with koi fish wraps around him, and he holds a golden chalice near his chest. The Colorado River winds through the red rock landscape beneath the distant La Sal Mountains. His gaze is direct but distant, the soft glow of a halo behind his head suggesting inner longing and poetic grace. He rides not for conquest, but connection.",
  "visual_description": "Frank Ocean, clad in silver armor with a deep teal cape patterned in red koi, rides a white horse through Castle Valley. The Colorado River winds behind him, with the La Sal Mountains on the horizon. He holds a golden cup aloft, haloed in soft light. His expression is contemplative, romantic.",
  "general_meaning": "A soulful quest fueled by emotion, creativity, or connection. You are moved by a dream—follow it with care and sincerity.",
  "love": "Charming but sensitive—be clear with your intentions and guard against fantasy overtaking reality.",
  "spiritual": "A call to explore deeper emotional waters. Trust your inner artist or dreamer.",
  "career": "Creative roles, emotionally driven missions, or meaningful collaborations. You may be called to lead with feeling.",
  "reversed": "Moodiness or illusion. Don’t chase beauty without depth—or promises without substance."
},
  "queen_of_cups": {
  "name": "Queen of Cups",
  "number": 13,
  "title": "Back & Forth It Go",
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/34-queen-of-cups.png",
  "keywords": ["Compassion", "Intuition", "Emotional Depth", "Healing", "Sacred Femininity"],
  "description": "SZA sits on a throne carved from pale stone, adorned in Northern Water Tribe ceremonial robes trimmed with golden embroidery and fur. Her long, flowing hair curls around her shoulders like ink in water. A glowing chalice rests in her hands, its shimmering contents pulsing with emotional magic. Though serene, her gaze holds storms. The sea laps at her feet, and stylized waves and fish are etched into the throne—symbols of intuitive power and depth of feeling.",
  "visual_description": "SZA, depicted as the Queen of Cups, wears blue-and-gold Water Tribe regalia with fur trim, seated on an ornate throne carved with a fish motif. Her expression is calm and mysterious. She holds a radiant chalice in her lap, and her long hair flows into the swirling water that surrounds her feet.",
  "general_meaning": "Embody the depths of your inner world with grace. This queen governs the realm of emotion, offering insight, care, and psychic clarity.",
  "love": "A nurturing, deeply empathetic partner or energy. Listen to your heart—and theirs.",
  "spiritual": "You’re in tune with the unseen. Trust your intuition and practice emotional alchemy.",
  "career": "Emotional intelligence leads. Ideal for roles in healing, guidance, or art.",
  "reversed": "Emotional overwhelm, codependency, or manipulation. Recenter and reconnect with your core self."
},
  "king_of_cups": {
  "name": "King of Cups",
  "number": 14,
  "title": "Don’t Be No Drag",
  "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/35-king-of-cups.png",
  "keywords": ["Wisdom", "Emotional Balance", "Leadership", "Compassion", "Depth"],
  "description": "Bob Marley sits in meditation atop a sea turtle, dressed in flowing garments patterned like ocean currents. A golden chalice steams gently in one hand, while the other grips a simple scepter. Behind him, waves rise and swirl, a fish jumps, and a ship sails into a glowing sunset. His expression is steady, present—both detached and deeply feeling. A crown rests calmly on his head, signaling a ruler who leads with empathy and clarity.",
  "visual_description": "Bob Marley is seated cross-legged on a sea turtle, robed in flowing oceanic blues with swirling wave motifs. He holds a chalice in one hand and a golden scepter in the other. His expression is calm and wise. A ship sails on the left and a fish leaps on the right under a vibrant red-and-orange sky.",
  "general_meaning": "Mastery of emotion and leadership rooted in heart. The King of Cups navigates storms with stillness and love.",
  "love": "A deeply supportive, emotionally mature partner may appear—or you are being called to embody that yourself.",
  "spiritual": "You are in tune with your inner world and capable of guiding others. Anchor your intuition with grace.",
  "career": "Lead with empathy. Creative or healing professions thrive under your steady influence.",
  "reversed": "Emotional manipulation, mood swings, or avoidance. Beware of hiding behind calm instead of engaging with truth."
},
  "ace_of_swords": {
    "name": "Ace Of Swords",
    "number": 36,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/36-ace-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "two_of_swords": {
    "name": "Two Of Swords",
    "number": 37,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/37-two-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "three_of_swords": {
    "name": "Three Of Swords",
    "number": 38,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/38-three-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "four_of_swords": {
    "name": "Four Of Swords",
    "number": 39,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/39-four-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "five_of_swords": {
    "name": "Five Of Swords",
    "number": 40,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/40-five-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "six_of_swords": {
    "name": "Six Of Swords",
    "number": 41,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/41-six-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "seven_of_swords": {
    "name": "Seven Of Swords",
    "number": 42,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/42-seven-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "eight_of_swords": {
    "name": "Eight Of Swords",
    "number": 43,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/43-eight-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "nine_of_swords": {
    "name": "Nine Of Swords",
    "number": 44,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/44-nine-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "ten_of_swords": {
    "name": "Ten Of Swords",
    "number": 45,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/45-ten-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "page_of_swords": {
    "name": "Page Of Swords",
    "number": 46,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/46-page-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "knight_of_swords": {
    "name": "Knight Of Swords",
    "number": 47,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/47-knight-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "queen_of_swords": {
    "name": "Queen Of Swords",
    "number": 48,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/48-queen-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "king_of_swords": {
    "name": "King Of Swords",
    "number": 49,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/49-king-of-swords.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "ace_of_wands": {
    "name": "Ace Of Wands",
    "number": 50,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/50-ace-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "two_of_wands": {
    "name": "Two Of Wands",
    "number": 51,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/51-two-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "three_of_wands": {
    "name": "Three Of Wands",
    "number": 52,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/52-three-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "four_of_wands": {
    "name": "Four Of Wands",
    "number": 53,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/53-four-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "five_of_wands": {
    "name": "Five Of Wands",
    "number": 54,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/54-five-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "six_of_wands": {
    "name": "Six Of Wands",
    "number": 55,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/55-six-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "seven_of_wands": {
    "name": "Seven Of Wands",
    "number": 56,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/56-seven-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "eight_of_wands": {
    "name": "Eight Of Wands",
    "number": 57,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/57-eight-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "nine_of_wands": {
    "name": "Nine Of Wands",
    "number": 58,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/58-nine-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "ten_of_wands": {
    "name": "Ten Of Wands",
    "number": 59,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/59-ten-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "page_of_wands": {
    "name": "Page Of Wands",
    "number": 60,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/60-page-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "knight_of_wands": {
    "name": "Knight Of Wands",
    "number": 61,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/61-knight-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "queen_of_wands": {
    "name": "Queen Of Wands",
    "number": 62,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/62-queen-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "king_of_wands": {
    "name": "King Of Wands",
    "number": 63,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/63-king-of-wands.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "ace_of_pentacles": {
    "name": "Ace Of Pentacles",
    "number": 64,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/64-ace-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "two_of_pentacles": {
    "name": "Two Of Pentacles",
    "number": 65,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/65-two-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "three_of_pentacles": {
    "name": "Three Of Pentacles",
    "number": 66,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/66-three-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "four_of_pentacles": {
    "name": "Four Of Pentacles",
    "number": 67,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/67-four-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "five_of_pentacles": {
    "name": "Five Of Pentacles",
    "number": 68,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/68-five-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "six_of_pentacles": {
    "name": "Six Of Pentacles",
    "number": 69,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/69-six-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "seven_of_pentacles": {
    "name": "Seven Of Pentacles",
    "number": 70,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/70-seven-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "eight_of_pentacles": {
    "name": "Eight Of Pentacles",
    "number": 71,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/71-eight-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "nine_of_pentacles": {
    "name": "Nine Of Pentacles",
    "number": 72,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/72-nine-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "ten_of_pentacles": {
    "name": "Ten Of Pentacles",
    "number": 73,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/73-ten-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "page_of_pentacles": {
    "name": "Page Of Pentacles",
    "number": 74,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/74-page-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "knight_of_pentacles": {
    "name": "Knight Of Pentacles",
    "number": 75,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/75-knight-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "queen_of_pentacles": {
    "name": "Queen Of Pentacles",
    "number": 76,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/76-queen-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  },
  "king_of_pentacles": {
    "name": "King Of Pentacles",
    "number": 77,
    "image_url": "https://highlig.github.io/ricky-wahite-tarot/images/77-king-of-pentacles.png",
    "keywords": [],
    "description": "",
    "visual_description": "",
    "general_meaning": "",
    "love": "",
    "spiritual": "",
    "career": "",
    "reversed": ""
  }
}
